update dot_std
